Revit 2027 API
ParameterTypeId.RbsElecRoomLightingCalcLuminaireplane Property
 "Lighting Calculation Luminaire Plane"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsElecRoomLightingCalcLuminaireplane { get; }
Public Shared ReadOnly Property RbsElecRoomLightingCalcLuminaireplane As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsElecRoomLightingCalcLuminaireplane {
	ForgeTypeId^ get ();
}
static member RbsElecRoomLightingCalcLuminaireplane : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace